TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_eventlp.h
typedef struct {
       uint32_t RESERVED0[62];
  __I  uint32_t DESC_EX;                           /* !< (@ 0x000010F8) Extended Module Description */
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  EVENTLP_SECCFG_FSUB_Regs  FSUB;                              /* !< (@ 0x00001100) */
       uint32_t RESERVED1[32];
  EVENTLP_SECCFG_FPUB_Regs  FPUB;                              /* !< (@ 0x00001180) */
       uint32_t RESERVED2[32];
  EVENTLP_SECCFG_EXPORT_Regs  EXPORT;                            /* !< (@ 0x00001200) */
       uint8_t  RESERVED3[127];
  EVENTLP_SECCFG_IMPORT_Regs  IMPORT;                            /* !< (@ 0x00001280) */
       uint8_t  RESERVED4[127];
  EVENTLP_SECCFG_CPU_CONNECT_Regs  CPU_CONNECT;                       /* !< (@ 0x00001300) */
       uint32_t RESERVED5[64];
  __IO uint8_t CTL;                               /* !< (@ 0x00001400) Event Manager control register */
} EVENTLP_SECCFG_Regs;

/*@}*/ /* end of group EVENTLP_SECCFG */

/** @addtogroup EVENTLP_PUBCFG_CPU_CONNECT
  @{
*/

typedef struct {
  __IO uint32_t CPU_NUM;                           /* !< (@ 0x00000900) CPU connect register */
} EVENTLP_PUBCFG_CPU_CONNECT_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG_CPU_CONNECT */

/** @addtogroup EVENTLP_PUBCFG_IMPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00000700) Import channel ID registe */
} EVENTLP_PUBCFG_IMPORT_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG_IMPORT */

/** @addtogroup EVENTLP_PUBCFG_EXPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00000500) Export channel ID register */
} EVENTLP_PUBCFG_EXPORT_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG_EXPORT */

/** @addtogroup EVENTLP_PUBCFG_FPUB
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00000300) Publisher channel ID register */
} EVENTLP_PUBCFG_FPUB_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG_FPUB */

/** @addtogroup EVENTLP_PUBCFG_FSUB
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00000100) Subscriber channel ID register */
} EVENTLP_PUBCFG_FSUB_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG_FSUB */

/** @addtogroup EVENTLP_PUBCFG
  @{
*/

typedef struct {
       uint32_t RESERVED0[62];
  __I  uint32_t DESC_EX;                           /* !< (@ 0x000000F8) Extended Module Description */
  __I  uint32_t DESC;                              /* !< (@ 0x000000FC) Module Description */
  EVENTLP_PUBCFG_FSUB_Regs  FSUB;                              /* !< (@ 0x00000100) */
       uint32_t RESERVED1[128];
  EVENTLP_PUBCFG_FPUB_Regs  FPUB;                              /* !< (@ 0x00000300) */
       uint32_t RESERVED2[128];
  EVENTLP_PUBCFG_EXPORT_Regs  EXPORT;                            /* !< (@ 0x00000500) */
       uint32_t RESERVED3[127];
  EVENTLP_PUBCFG_IMPORT_Regs  IMPORT;                            /* !< (@ 0x00000700) */
       uint32_t RESERVED4[127];
  EVENTLP_PUBCFG_CPU_CONNECT_Regs  CPU_CONNECT;                       /* !< (@ 0x00000900) */
} EVENTLP_PUBCFG_Regs;

/*@}*/ /* end of group EVENTLP_PUBCFG */

/** @addtogroup EVENTLP
  @{
*/

typedef struct {
  EVENTLP_PUBCFG_Regs  PUBCFG;                            /* !< (@ 0x00000000) */
       uint32_t RESERVED0[448];
  EVENTLP_SECCFG_Regs  SECCFG;                            /* !< (@ 0x00001000) */
       uint8_t  RESERVED1[3071];
  EVENTLP_IMPEXPCFG_Regs  IMPEXPCFG;                         /* !< (@ 0x00002000) */
} EVENTLP_Regs;

/*@}*/ /* end of group EVENTLP */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* EVENTLP Register Control Bits
******************************************************************************/

/* EVENTLP_IMPEXPCFG_IMPORT_PORT Bits */
/* EVENTLP_IMPEXPCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTLP_IMPEXPCFG_IMPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTLP_IMPEXPCFG_IMPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTLP_IMPEXPCFG_IMPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_IMPEXPCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_IMPEXPCFG_EXPORT_PORT Bits */
/* EVENTLP_IMPEXPCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTLP_IMPEXPCFG_EXPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTLP_IMPEXPCFG_EXPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTLP_IMPEXPCFG_EXPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_IMPEXPCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_SECCFG_CPU_NUM Bits */

/* EVENTLP_SECCFG_IMPORT_PORT Bits */
/* EVENTLP_SECCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTLP_SECCFG_IMPORT_PORT_CHANID_OFS    (0)                             /* !< CHANID Offset */
#define EVENTLP_SECCFG_IMPORT_PORT_CHANID_MASK   ((uint8_t)0x000000FFU)          /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTLP_SECCFG_IMPORT_PORT_CHANID_MINIMUM ((uint8_t)0x00000000U)          /* !< Minimum value -- 0 has no effect */
#define EVENTLP_SECCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint8_t)0x000000FFU)          /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_SECCFG_EXPORT_PORT Bits */
/* EVENTLP_SECCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTLP_SECCFG_EXPORT_PORT_CHANID_OFS    (0)                             /* !< CHANID Offset */
#define EVENTLP_SECCFG_EXPORT_PORT_CHANID_MASK   ((uint8_t)0x000000FFU)          /* !< Channel ID for export side to
                                                                                    connect to */
#define EVENTLP_SECCFG_EXPORT_PORT_CHANID_MINIMUM ((uint8_t)0x00000000U)          /* !< Minimum value -- 0 has no effect */
#define EVENTLP_SECCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint8_t)0x000000FFU)          /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

