TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_eventlp.h
/* EVENTLP_PUBCFG_IMPORT_PORT Bits */
/* EVENTLP_PUBCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTLP_PUBCFG_IMPORT_PORT_CHANID_OFS    (0)                             /* !< CHANID Offset */
#define EVENTLP_PUBCFG_IMPORT_PORT_CHANID_MASK   ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTLP_PUBCFG_IMPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_PUBCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_PUBCFG_EXPORT_PORT Bits */
/* EVENTLP_PUBCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTLP_PUBCFG_EXPORT_PORT_CHANID_OFS    (0)                             /* !< CHANID Offset */
#define EVENTLP_PUBCFG_EXPORT_PORT_CHANID_MASK   ((uint32_t)0x000000FFU)         /* !< Channel ID for export side to
                                                                                    connect to */
#define EVENTLP_PUBCFG_EXPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_PUBCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_PUBCFG_FPUB_PORT Bits */
/* EVENTLP_PUBCFG_FPUB_PORT[CHANID] Bits */
#define EVENTLP_PUBCFG_FPUB_PORT_CHANID_OFS      (0)                             /* !< CHANID Offset */
#define EVENTLP_PUBCFG_FPUB_PORT_CHANID_MASK     ((uint32_t)0x000000FFU)         /* !< Channel ID for publisher to connect
                                                                                    to */
#define EVENTLP_PUBCFG_FPUB_PORT_CHANID_MINIMUM  ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_PUBCFG_FPUB_PORT_CHANID_MAXIMUM  ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_PUBCFG_FSUB_PORT Bits */
/* EVENTLP_PUBCFG_FSUB_PORT[CHANID] Bits */
#define EVENTLP_PUBCFG_FSUB_PORT_CHANID_OFS      (0)                             /* !< CHANID Offset */
#define EVENTLP_PUBCFG_FSUB_PORT_CHANID_MASK     ((uint32_t)0x000000FFU)         /* !< Channel ID for subscriber to
                                                                                    connect to */
#define EVENTLP_PUBCFG_FSUB_PORT_CHANID_MINIMUM  ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTLP_PUBCFG_FSUB_PORT_CHANID_MAXIMUM  ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTLP_PUBCFG_DESC_EX Bits */
/* EVENTLP_PUBCFG_DESC_EX[NUM_SINGLE_CHANNEL] Bits */
#define EVENTLP_PUBCFG_DESC_EX_NUM_SINGLE_CHANNEL_OFS (0)                             /* !< NUM_SINGLE_CHANNEL Offset */
#define EVENTLP_PUBCFG_DESC_EX_NUM_SINGLE_CHANNEL_MASK ((uint32_t)0x000000FFU)         /* !< Number of single channels contained
                                                                                    in this instance of event manager */
/* EVENTLP_PUBCFG_DESC_EX[NUM_DUAL_CHANNEL] Bits */
#define EVENTLP_PUBCFG_DESC_EX_NUM_DUAL_CHANNEL_OFS (8)                             /* !< NUM_DUAL_CHANNEL Offset */
#define EVENTLP_PUBCFG_DESC_EX_NUM_DUAL_CHANNEL_MASK ((uint32_t)0x0000FF00U)         /* !< Number of dual channels contained
                                                                                    in this instance of event manager */
/* EVENTLP_PUBCFG_DESC_EX[NUM_IMPORT] Bits */
#define EVENTLP_PUBCFG_DESC_EX_NUM_IMPORT_OFS    (16)                            /* !< NUM_IMPORT Offset */
#define EVENTLP_PUBCFG_DESC_EX_NUM_IMPORT_MASK   ((uint32_t)0x00FF0000U)         /* !< Number of import ports available in
                                                                                    this EventManager instantiation */
/* EVENTLP_PUBCFG_DESC_EX[NUM_EXPORT] Bits */
#define EVENTLP_PUBCFG_DESC_EX_NUM_EXPORT_OFS    (24)                            /* !< NUM_EXPORT Offset */
#define EVENTLP_PUBCFG_DESC_EX_NUM_EXPORT_MASK   ((uint32_t)0xFF000000U)         /* !< Number of export ports available in
                                                                                    this EventManager instantiation */

/* EVENTLP_PUBCFG_DESC Bits */
/* EVENTLP_PUBCFG_DESC[MINREV] Bits */
#define EVENTLP_PUBCFG_DESC_MINREV_OFS           (0)                             /* !< MINREV Offset */
#define EVENTLP_PUBCFG_DESC_MINREV_MASK          ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define EVENTLP_PUBCFG_DESC_MINREV_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define EVENTLP_PUBCFG_DESC_MINREV_MAXIMUM       ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* EVENTLP_PUBCFG_DESC[MAJREV] Bits */
#define EVENTLP_PUBCFG_DESC_MAJREV_OFS           (4)                             /* !< MAJREV Offset */
#define EVENTLP_PUBCFG_DESC_MAJREV_MASK          ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define EVENTLP_PUBCFG_DESC_MAJREV_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define EVENTLP_PUBCFG_DESC_MAJREV_MAXIMUM       ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* EVENTLP_PUBCFG_DESC[INSTNUM] Bits */
#define EVENTLP_PUBCFG_DESC_INSTNUM_OFS          (8)                             /* !< INSTNUM Offset */
#define EVENTLP_PUBCFG_DESC_INSTNUM_MASK         ((uint32_t)0x00000F00U)         /* !< Instance Number within the device.
                                                                                    This will be a parameter to the RTL
                                                                                    for modules that can have multiple
                                                                                    instances */
#define EVENTLP_PUBCFG_DESC_INSTNUM_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define EVENTLP_PUBCFG_DESC_INSTNUM_MAXIMUM      ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* EVENTLP_PUBCFG_DESC[FEATUREVER] Bits */
#define EVENTLP_PUBCFG_DESC_FEATUREVER_OFS       (12)                            /* !< FEATUREVER Offset */
#define EVENTLP_PUBCFG_DESC_FEATUREVER_MASK      ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define EVENTLP_PUBCFG_DESC_FEATUREVER_MINIMUM   ((uint32_t)0x00000000U)         /* !< Smallest value */
#define EVENTLP_PUBCFG_DESC_FEATUREVER_MAXIMUM   ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* EVENTLP_PUBCFG_DESC[MODULEID] Bits */
#define EVENTLP_PUBCFG_DESC_MODULEID_OFS         (16)                            /* !< MODULEID Offset */
#define EVENTLP_PUBCFG_DESC_MODULEID_MASK        ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define EVENTLP_PUBCFG_DESC_MODULEID_MINIMUM     ((uint32_t)0x00000000U)         /* !< Smallest value */
#define EVENTLP_PUBCFG_DESC_MODULEID_MAXIMUM     ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_eventlp__include */

